rick1082/sdk-nrf/samples/bluetooth/bap_unicast_server_nrf54l15/src/main.c
static void ble_send_thread(void *arg1, void *arg2, void *arg3)
{
	uint8_t buffer[RINGBUF_BLOCKS * PDM_SAMPLE_BLOCK_SIZE];
	uint16_t previous_data[960];
	while (true) {
		k_sem_take(&lc3_encoder_sem, K_FOREVER);
		//printk("ble_send_thread %d\n", ring_buf_size_get(&audio_ring_buf));
		uint16_t ring_buffer_size = ring_buf_size_get(&audio_ring_buf);
		if ( ring_buffer_size>= 960) {
			size_t size = ring_buf_get(&audio_ring_buf, buffer,
							 960);
			memcpy(send_pcm_data, buffer, size);
			memcpy(previous_data, send_pcm_data, sizeof(send_pcm_data));

		} else {
			// try to fetch the maximum size, and then add the remaining data
			//printk("Ring buffer not enough data, now only");
			//printk(" %d\n", ring_buffer_size);
			ring_buf_get(&audio_ring_buf, buffer, ring_buffer_size%960);
			memcpy(send_pcm_data, previous_data+(960-ring_buffer_size%960)/2, sizeof(960-ring_buffer_size%960)/2);
			memcpy(send_pcm_data+(960-ring_buffer_size%960)/2, buffer, ring_buffer_size%960/2);
			//memcpy(send_pcm_data, previous_data, sizeof(send_pcm_data));
		}
		//dk_set_led_on(BLE_STATE);
		send_data();
		//dk_set_led_off(BLE_STATE);
	}
}

static void dmic_fetch_thread(void *arg1, void *arg2, void *arg3)
{
	int ret;
	void *buffer;
	uint32_t size;
	static int16_t pcm_data[MAX_NUM_SAMPLES];
	while (true) {

		//k_sem_take(&lc3_encoder_sem, K_FOREVER);

		if (pdm_sample_start == false) {
			k_sleep(K_MSEC(5));
			continue;
		}
		dk_set_led_on(PDM_STATE);
		ret = dmic_read(dmic_dev, 0, &buffer, &size, 10);
		dk_set_led_off(PDM_STATE);
		if (ret < 0) {
			LOG_INF("DMIC read failed: %d", ret);
		}
		if (size > sizeof(pcm_data)) {
			LOG_INF("Buffer size exceeds send_pcm_data size");
			size = sizeof(pcm_data);
		}
		memcpy(pcm_data, buffer, size);
		
		k_mem_slab_free(&mem_slab, buffer);
		size_t wrote = ring_buf_put(&audio_ring_buf, (uint8_t *)pcm_data, size);
		if (wrote < size) {
			printk("Ring buffer full, dropped one audio block %d %d \n", wrote, size);
			//break;
		}
/*
		for (size_t offset = 0; offset + PDM_SAMPLE_BLOCK_SIZE <= size; offset += PDM_SAMPLE_BLOCK_SIZE) {
			size_t wrote = ring_buf_put(&audio_ring_buf, send_pcm_data[offset], PDM_SAMPLE_BLOCK_SIZE);
			if (wrote < PDM_SAMPLE_BLOCK_SIZE) {
				printk("Ring buffer full, dropped one audio block\n");
				break;
			}
		}
*/		
		//k_sleep(K_MSEC(5));
		//send_data();
	}
}

static int pdm_mic_init()
{
	int err;
	struct pcm_stream_cfg stream = {
		.pcm_width = SAMPLE_BIT_WIDTH,
		.mem_slab = &mem_slab,
	};
	struct dmic_cfg cfg = {
		.io =
			{
				/* These fields can be used to limit the PDM clock
				 * configurations that the driver is allowed to use
				 * to those supported by the microphone.
				 */
				.min_pdm_clk_freq = 1000000,
				.max_pdm_clk_freq = 3250000,
				.min_pdm_clk_dc = 40,
				.max_pdm_clk_dc = 60,
			},
		.streams = &stream,
		.channel =
			{
				.req_num_streams = 1,
			},
	};

	err = device_is_ready(dmic_dev);
	if (err < 0) {
		LOG_INF("DMIC device is not ready: %d", err);
		return err;
	}

	cfg.channel.req_num_chan = 1;
	cfg.channel.req_chan_map_lo = dmic_build_channel_map(0, 0, PDM_CHAN_LEFT);
	cfg.streams[0].pcm_rate = MAX_SAMPLE_RATE;
	cfg.streams[0].block_size = BLOCK_SIZE(cfg.streams[0].pcm_rate, cfg.channel.req_num_chan);

	err = dmic_configure(dmic_dev, &cfg);
	if (err < 0) {
		LOG_INF("Failed to configure the driver: %d", err);
		return err;
	}

	//nrf_pdm_gain_set(NRF_PDM20_S, GAIN_DEFAULT, GAIN_DEFAULT);
	nrf_pdm_ratio_set(NRF_PDM20_S, 0);
	nrf_pdm_prescaler_set(NRF_PDM20_S, 21);

	return 0;
}

/* Handles button state changes and adjusts PDM gain accordingly */
static void button_changed(uint32_t button_state, uint32_t has_changed)
{
	static uint8_t pdm_gain = NRF_PDM_GAIN_DEFAULT;
	if ((button_state & has_changed) & GAIN_UP_BTN) {
		if (pdm_gain + GAIN_STEP < NRF_PDM_GAIN_MAXIMUM) {
			pdm_gain += GAIN_STEP;
			nrf_pdm_gain_set(NRF_PDM20_S, pdm_gain, pdm_gain);
			LOG_INF("Gain set to %d", pdm_gain);
		} else {
			nrf_pdm_gain_set(NRF_PDM20_S, NRF_PDM_GAIN_MAXIMUM, NRF_PDM_GAIN_MAXIMUM);
			LOG_INF("Gain is already at maximum");
		}
	} else if ((button_state & has_changed) & GAIN_DOWN_BTN) {
		if (pdm_gain - GAIN_STEP > 0) {
			pdm_gain -= GAIN_STEP;
			nrf_pdm_gain_set(NRF_PDM20_S, pdm_gain, pdm_gain);
			LOG_INF("Gain set to %d", pdm_gain);
		} else {
			nrf_pdm_gain_set(NRF_PDM20_S, NRF_PDM_GAIN_MINIMUM, NRF_PDM_GAIN_MINIMUM);
			LOG_INF("Gain is already at minimum");
		}
	}
}

int main(void)
{
	struct bt_le_ext_adv *adv;
	int err;

	err = clocks_start();
	if (err) {
		LOG_INF("Failed to start clocks (err %d)", err);
		return 0;
	}

	err = dk_leds_init();
	if (err) {
		LOG_ERR("Cannot init LEDs (err: %d)", err);
	}

	err = dk_buttons_init(button_changed);
	if (err) {
		LOG_ERR("Cannot init buttons (err: %d)", err);
	}

	err = pdm_mic_init();
	if (err) {
		LOG_ERR("Cannot init PDM mic (err: %d)", err);
	}

	err = bt_enable(NULL);
	if (err != 0) {
		LOG_INF("Bluetooth init failed (err %d)", err);
		return 0;
	}

	LOG_INF("Bluetooth initialized");

	err = sw_codec_lc3_init(NULL, NULL, MAX_FRAME_DURATION_US);
	if (err) {
		LOG_INF("sw_codec_lc3_init failed (err %d)", err);
	}

	bt_bap_unicast_server_register(&param);
	bt_bap_unicast_server_register_cb(&unicast_server_cb);

	bt_pacs_cap_register(BT_AUDIO_DIR_SINK, &cap_sink);
	bt_pacs_cap_register(BT_AUDIO_DIR_SOURCE, &cap_source);

	for (size_t i = 0; i < ARRAY_SIZE(sink_streams); i++) {
		bt_bap_stream_cb_register(&sink_streams[i], &stream_ops);
	}

	for (size_t i = 0; i < ARRAY_SIZE(source_streams); i++) {
		bt_bap_stream_cb_register(&source_streams[i].stream, &stream_ops);
	}

	err = set_location();
	if (err != 0) {
		return 0;
	}

	err = set_supported_contexts();
	if (err != 0) {
		return 0;
	}

	err = set_available_contexts();
	if (err != 0) {
		return 0;
	}

	/* Create a connectable advertising set */
	err = bt_le_ext_adv_create(BT_LE_EXT_ADV_CONN, NULL, &adv);
	if (err) {
		LOG_INF("Failed to create advertising set (err %d)", err);
		return 0;
	}

	err = bt_le_ext_adv_set_data(adv, ad, ARRAY_SIZE(ad), NULL, 0);
	if (err) {
		LOG_INF("Failed to set advertising data (err %d)", err);
		return 0;
	}

	k_thread_start(dmic_fetch);
	k_thread_start(ble_send);

	while (true) {
		err = bt_le_ext_adv_start(adv, BT_LE_EXT_ADV_START_DEFAULT);
		if (err) {
			LOG_INF("Failed to start advertising set (err %d)", err);
			return 0;
		}

		LOG_INF("Advertising successfully started");

		err = k_sem_take(&sem_disconnected, K_FOREVER);
		if (err != 0) {
			LOG_INF("failed to take sem_disconnected (err %d)", err);
			return 0;
		}

		/* reset data */
		configured_source_stream_count = 0U;
	}
	return 0;
}
